###################################################################

# Created by write_sdc on Tue May 16 20:38:13 2023

###################################################################
set sdc_version 2.0

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_area 0
set_load -pin_load 0.2 [get_ports v13_D_9]
set_load -pin_load 0.2 [get_ports v13_D_8]
set_load -pin_load 0.2 [get_ports v13_D_7]
set_load -pin_load 0.2 [get_ports v13_D_6]
set_load -pin_load 0.2 [get_ports v13_D_12]
set_load -pin_load 0.2 [get_ports v13_D_11]
set_load -pin_load 0.2 [get_ports v13_D_10]
set_propagated_clock [get_ports CK]
create_clock [get_ports CK]  -name ideal_clock1  -period 2  -waveform {0 1}
set_clock_latency 0.4  [get_clocks ideal_clock1]
set_clock_uncertainty 0.1  [get_clocks ideal_clock1]
set_input_delay -clock ideal_clock1  0.1  [get_ports GND]
set_input_delay -clock ideal_clock1  0.1  [get_ports VDD]
set_input_delay -clock ideal_clock1  0.1  [get_ports v0]
set_input_delay -clock ideal_clock1  0.1  [get_ports v1]
set_input_delay -clock ideal_clock1  0.1  [get_ports v2]
set_input_delay -clock ideal_clock1  0.1  [get_ports v3]
set_input_delay -clock ideal_clock1  0.1  [get_ports v4]
set_input_delay -clock ideal_clock1  0.1  [get_ports v5]
set_input_delay -clock ideal_clock1  0.1  [get_ports v6]
set_output_delay -clock ideal_clock1  0.1  [get_ports v13_D_10]
set_output_delay -clock ideal_clock1  0.1  [get_ports v13_D_11]
set_output_delay -clock ideal_clock1  0.1  [get_ports v13_D_12]
set_output_delay -clock ideal_clock1  0.1  [get_ports v13_D_6]
set_output_delay -clock ideal_clock1  0.1  [get_ports v13_D_7]
set_output_delay -clock ideal_clock1  0.1  [get_ports v13_D_8]
set_output_delay -clock ideal_clock1  0.1  [get_ports v13_D_9]
set_load -max 0.314617  [get_nets n55]
set_load -min 0.271899  [get_nets n55]
set_resistance 4.307e-06  [get_nets n55]
set_load -max 0.445597  [get_nets n57]
set_load -min 0.401286  [get_nets n57]
set_resistance 8.5811e-06  [get_nets n57]
set_load -max 0.574304  [get_nets n58]
set_load -min 0.51231  [get_nets n58]
set_resistance 8.94934e-06  [get_nets n58]
set_load -max 0.561329  [get_nets n36]
set_load -min 0.499898  [get_nets n36]
set_resistance 9.89946e-06  [get_nets n36]
set_load -max 1.38852  [get_nets n50]
set_load -min 1.24818  [get_nets n50]
set_resistance 2.57118e-05  [get_nets n50]
set_load -max 0.992112  [get_nets n56]
set_load -min 0.888274  [get_nets n56]
set_resistance 1.78168e-05  [get_nets n56]
set_load -max 0.352958  [get_nets n54]
set_load -min 0.319331  [get_nets n54]
set_resistance 7.25254e-06  [get_nets n54]
set_load -max 0.799839  [get_nets n53]
set_load -min 0.718836  [get_nets n53]
set_resistance 1.36737e-05  [get_nets n53]
set_load -max 0.890033  [get_nets n2]
set_load -min 0.785778  [get_nets n2]
set_resistance 1.64999e-05  [get_nets n2]
set_load -max 0.455493  [get_nets n9]
set_load -min 0.410383  [get_nets n9]
set_resistance 8.99001e-06  [get_nets n9]
set_load -max 0.602369  [get_nets n61]
set_load -min 0.540067  [get_nets n61]
set_resistance 1.12718e-05  [get_nets n61]
set_load -max 0.37004  [get_nets n49]
set_load -min 0.323208  [get_nets n49]
set_resistance 5.45055e-06  [get_nets n49]
set_load -max 0.910131  [get_nets n10]
set_load -min 0.818164  [get_nets n10]
set_resistance 1.70448e-05  [get_nets n10]
set_load -max 0.383322  [get_nets n38]
set_load -min 0.339213  [get_nets n38]
set_resistance 5.70002e-06  [get_nets n38]
set_load -max 1.7959  [get_nets n35]
set_load -min 1.62652  [get_nets n35]
set_resistance 3.38514e-05  [get_nets n35]
set_load -max 0.367422  [get_nets n34]
set_load -min 0.32987  [get_nets n34]
set_resistance 6.32743e-06  [get_nets n34]
set_load -max 2.40094  [get_nets n23]
set_load -min 2.15552  [get_nets n23]
set_resistance 4.20472e-05  [get_nets n23]
set_load -max 0.382009  [get_nets n25]
set_load -min 0.339943  [get_nets n25]
set_resistance 6.26756e-06  [get_nets n25]
set_load -max 0.424517  [get_nets n29]
set_load -min 0.384643  [get_nets n29]
set_resistance 8.8548e-06  [get_nets n29]
set_load -max 0.239149  [get_nets n5]
set_load -min 0.2169  [get_nets n5]
set_resistance 5.75936e-06  [get_nets n5]
set_load -max 0.311409  [get_nets n30]
set_load -min 0.275511  [get_nets n30]
set_resistance 5.70087e-06  [get_nets n30]
set_load -max 1.45581  [get_nets n41]
set_load -min 1.30962  [get_nets n41]
set_resistance 2.54758e-05  [get_nets n41]
set_load -max 0.893605  [get_nets n45]
set_load -min 0.799973  [get_nets n45]
set_resistance 1.51982e-05  [get_nets n45]
set_load -max 1.34593  [get_nets n16]
set_load -min 1.20807  [get_nets n16]
set_resistance 2.21937e-05  [get_nets n16]
set_load -max 1.45028  [get_nets n21]
set_load -min 1.29779  [get_nets n21]
set_resistance 2.37092e-05  [get_nets n21]
set_load -max 0.949624  [get_nets n37]
set_load -min 0.856209  [get_nets n37]
set_resistance 1.76655e-05  [get_nets n37]
set_load -max 1.76264  [get_nets n18]
set_load -min 1.58348  [get_nets n18]
set_resistance 3.21918e-05  [get_nets n18]
set_load -max 0.72103  [get_nets n47]
set_load -min 0.639691  [get_nets n47]
set_resistance 1.00478e-05  [get_nets n47]
set_load -max 0.709032  [get_nets n19]
set_load -min 0.638114  [get_nets n19]
set_resistance 1.36015e-05  [get_nets n19]
set_load -max 0.161997  [get_nets n24]
set_load -min 0.140152  [get_nets n24]
set_resistance 2.27905e-06  [get_nets n24]
set_load -max 1.17473  [get_nets n64]
set_load -min 1.06564  [get_nets n64]
set_resistance 2.31712e-05  [get_nets n64]
set_load -max 1.31002  [get_nets n60]
set_load -min 1.17035  [get_nets n60]
set_resistance 1.98072e-05  [get_nets n60]
set_load -max 0.274889  [get_nets n43]
set_load -min 0.237445  [get_nets n43]
set_resistance 2.14722e-06  [get_nets n43]
set_load -max 0.221962  [get_nets n3]
set_load -min 0.195769  [get_nets n3]
set_resistance 3.85133e-06  [get_nets n3]
set_load -max 0.861547  [get_nets n42]
set_load -min 0.76664  [get_nets n42]
set_resistance 1.27507e-05  [get_nets n42]
set_load -max 0.651619  [get_nets n40]
set_load -min 0.590641  [get_nets n40]
set_resistance 1.29448e-05  [get_nets n40]
set_load -max 1.27372  [get_nets n8]
set_load -min 1.14071  [get_nets n8]
set_resistance 2.35881e-05  [get_nets n8]
set_load -max 0.668166  [get_nets n48]
set_load -min 0.599234  [get_nets n48]
set_resistance 1.06257e-05  [get_nets n48]
set_load -max 1.45627  [get_nets n20]
set_load -min 1.30221  [get_nets n20]
set_resistance 2.27013e-05  [get_nets n20]
set_load -max 0.379645  [get_nets n26]
set_load -min 0.330785  [get_nets n26]
set_resistance 4.90882e-06  [get_nets n26]
set_load -max 0.869295  [get_nets n27]
set_load -min 0.775338  [get_nets n27]
set_resistance 1.29616e-05  [get_nets n27]
set_load -max 0.627016  [get_nets n22]
set_load -min 0.55923  [get_nets n22]
set_resistance 9.04111e-06  [get_nets n22]
set_load -max 1.01577  [get_nets n14]
set_load -min 0.905918  [get_nets n14]
set_resistance 1.7308e-05  [get_nets n14]
set_load -max 0.487297  [get_nets n59]
set_load -min 0.437537  [get_nets n59]
set_resistance 9.2957e-06  [get_nets n59]
set_load -max 1.10548  [get_nets n39]
set_load -min 1.00012  [get_nets n39]
set_resistance 2.15745e-05  [get_nets n39]
set_load -max 1.41546  [get_nets n4]
set_load -min 1.26842  [get_nets n4]
set_resistance 2.38506e-05  [get_nets n4]
set_load -max 1.90278  [get_nets n51]
set_load -min 1.70382  [get_nets n51]
set_resistance 3.10419e-05  [get_nets n51]
set_load -max 0.930445  [get_nets n65]
set_load -min 0.835217  [get_nets n65]
set_resistance 1.60068e-05  [get_nets n65]
set_load -max 0.861597  [get_nets n67]
set_load -min 0.7739  [get_nets n67]
set_resistance 1.64202e-05  [get_nets n67]
set_load -max 0.532374  [get_nets n28]
set_load -min 0.469598  [get_nets n28]
set_resistance 7.66082e-06  [get_nets n28]
set_load -max 1.51974  [get_nets n1]
set_load -min 1.37495  [get_nets n1]
set_resistance 2.90948e-05  [get_nets n1]
set_load -max 1.12479  [get_nets n46]
set_load -min 1.00156  [get_nets n46]
set_resistance 1.61364e-05  [get_nets n46]
set_load -max 0.551988  [get_nets n44]
set_load -min 0.493469  [get_nets n44]
set_resistance 8.46666e-06  [get_nets n44]
set_load -max 0.585007  [get_nets n13]
set_load -min 0.525305  [get_nets n13]
set_resistance 1.04103e-05  [get_nets n13]
set_load -max 2.00882  [get_nets n17]
set_load -min 1.8148  [get_nets n17]
set_resistance 3.8163e-05  [get_nets n17]
set_load -max 0.636693  [get_nets n52]
set_load -min 0.563865  [get_nets n52]
set_resistance 8.04722e-06  [get_nets n52]
set_load -max 1.2311  [get_nets n31]
set_load -min 1.11  [get_nets n31]
set_resistance 2.39725e-05  [get_nets n31]
set_load -max 0.838337  [get_nets n33]
set_load -min 0.74297  [get_nets n33]
set_resistance 1.3816e-05  [get_nets n33]
set_load -max 0.944143  [get_nets n15]
set_load -min 0.851997  [get_nets n15]
set_resistance 1.77637e-05  [get_nets n15]
set_load -max 0.457342  [get_nets n32]
set_load -min 0.414537  [get_nets n32]
set_resistance 9.54651e-06  [get_nets n32]
set_load -max 1.14938  [get_nets Lv13_D_9]
set_load -min 1.05613  [get_nets Lv13_D_9]
set_resistance 2.50726e-05  [get_nets Lv13_D_9]
set_load -max 1.46007  [get_nets Lv13_D_8]
set_load -min 1.29625  [get_nets Lv13_D_8]
set_resistance 2.99418e-05  [get_nets Lv13_D_8]
set_load -max 1.20228  [get_nets Lv13_D_7]
set_load -min 1.10262  [get_nets Lv13_D_7]
set_resistance 2.37883e-05  [get_nets Lv13_D_7]
set_load -max 2.05306  [get_nets Lv13_D_6]
set_load -min 1.88095  [get_nets Lv13_D_6]
set_resistance 4.37486e-05  [get_nets Lv13_D_6]
set_load -max 1.61108  [get_nets Lv13_D_12]
set_load -min 1.47523  [get_nets Lv13_D_12]
set_resistance 3.26487e-05  [get_nets Lv13_D_12]
set_load -max 0.90544  [get_nets Lv13_D_11]
set_load -min 0.823175  [get_nets Lv13_D_11]
set_resistance 1.84591e-05  [get_nets Lv13_D_11]
set_load -max 1.6852  [get_nets Lv13_D_10]
set_load -min 1.49206  [get_nets Lv13_D_10]
set_resistance 3.28404e-05  [get_nets Lv13_D_10]
set_load -max 2.79818  [get_nets v6]
set_load -min 2.43704  [get_nets v6]
set_resistance 5.79651e-05  [get_nets v6]
set_load -max 3.55124  [get_nets v5]
set_load -min 3.23758  [get_nets v5]
set_resistance 7.05026e-05  [get_nets v5]
set_load -max 2.1139  [get_nets v4]
set_load -min 1.91691  [get_nets v4]
set_resistance 3.87908e-05  [get_nets v4]
set_load -max 1.60134  [get_nets v3]
set_load -min 1.46652  [get_nets v3]
set_resistance 3.30784e-05  [get_nets v3]
set_load -max 2.66994  [get_nets v2]
set_load -min 2.40214  [get_nets v2]
set_resistance 5.20881e-05  [get_nets v2]
set_load -max 3.20172  [get_nets v1]
set_load -min 2.90054  [get_nets v1]
set_resistance 6.13379e-05  [get_nets v1]
set_load -max 2.84353  [get_nets v0]
set_load -min 2.56575  [get_nets v0]
set_resistance 5.19514e-05  [get_nets v0]
set_load -max 3.60812  [get_nets CK]
set_load -min 3.33653  [get_nets CK]
set_resistance 8.32799e-05  [get_nets CK]
set_load -max 0.788689  [get_nets Lv13_D_0]
set_load -min 0.716696  [get_nets Lv13_D_0]
set_resistance 1.60508e-05  [get_nets Lv13_D_0]
set_load -max 3.04836  [get_nets v7]
set_load -min 2.7565  [get_nets v7]
set_resistance 5.94422e-05  [get_nets v7]
set_load -max 0.752439  [get_nets Lv13_D_1]
set_load -min 0.677958  [get_nets Lv13_D_1]
set_resistance 1.4104e-05  [get_nets Lv13_D_1]
set_load -max 1.51704  [get_nets v8]
set_load -min 1.36662  [get_nets v8]
set_resistance 2.74113e-05  [get_nets v8]
set_load -max 1.34661  [get_nets Lv13_D_2]
set_load -min 1.22504  [get_nets Lv13_D_2]
set_resistance 2.62189e-05  [get_nets Lv13_D_2]
set_load -max 2.28065  [get_nets v9]
set_load -min 2.05572  [get_nets v9]
set_resistance 4.1611e-05  [get_nets v9]
set_load -max 1.19479  [get_nets Lv13_D_3]
set_load -min 1.08891  [get_nets Lv13_D_3]
set_resistance 2.40761e-05  [get_nets Lv13_D_3]
set_load -max 2.8676  [get_nets v10]
set_load -min 2.58475  [get_nets v10]
set_resistance 5.07498e-05  [get_nets v10]
set_load -max 0.947734  [get_nets Lv13_D_4]
set_load -min 0.84992  [get_nets Lv13_D_4]
set_resistance 1.53183e-05  [get_nets Lv13_D_4]
set_load -max 2.45649  [get_nets v11]
set_load -min 2.21908  [get_nets v11]
set_resistance 5.06563e-05  [get_nets v11]
set_load -max 0.486085  [get_nets Lv13_D_5]
set_load -min 0.426054  [get_nets Lv13_D_5]
set_resistance 6.22522e-06  [get_nets Lv13_D_5]
set_load -max 1.33097  [get_nets v12]
set_load -min 1.20621  [get_nets v12]
set_resistance 2.71276e-05  [get_nets v12]
set_load -max 2.13903  [get_nets n71]
set_load -min 1.931  [get_nets n71]
set_resistance 4.01233e-05  [get_nets n71]
set_load -max 3.40016  [get_nets n72]
set_load -min 3.05411  [get_nets n72]
set_resistance 5.98466e-05  [get_nets n72]
set_load -max 2.66884  [get_nets n73]
set_load -min 2.40107  [get_nets n73]
set_resistance 4.95971e-05  [get_nets n73]
set_load -max 3.60812  [get_nets DFF_5/clk]
set_load -min 3.33653  [get_nets DFF_5/clk]
set_resistance 8.32799e-05  [get_nets DFF_5/clk]
set_load -max 0.788689  [get_nets DFF_5/d]
set_load -min 0.716696  [get_nets DFF_5/d]
set_resistance 1.60508e-05  [get_nets DFF_5/d]
set_load -max 3.04836  [get_nets DFF_5/q]
set_load -min 2.7565  [get_nets DFF_5/q]
set_resistance 5.94422e-05  [get_nets DFF_5/q]
set_load -max 3.60812  [get_nets DFF_4/clk]
set_load -min 3.33653  [get_nets DFF_4/clk]
set_resistance 8.32799e-05  [get_nets DFF_4/clk]
set_load -max 0.752439  [get_nets DFF_4/d]
set_load -min 0.677958  [get_nets DFF_4/d]
set_resistance 1.4104e-05  [get_nets DFF_4/d]
set_load -max 1.51704  [get_nets DFF_4/q]
set_load -min 1.36662  [get_nets DFF_4/q]
set_resistance 2.74113e-05  [get_nets DFF_4/q]
set_load -max 3.60812  [get_nets DFF_3/clk]
set_load -min 3.33653  [get_nets DFF_3/clk]
set_resistance 8.32799e-05  [get_nets DFF_3/clk]
set_load -max 1.34661  [get_nets DFF_3/d]
set_load -min 1.22504  [get_nets DFF_3/d]
set_resistance 2.62189e-05  [get_nets DFF_3/d]
set_load -max 2.28065  [get_nets DFF_3/q]
set_load -min 2.05572  [get_nets DFF_3/q]
set_resistance 4.1611e-05  [get_nets DFF_3/q]
set_load -max 3.60812  [get_nets DFF_2/clk]
set_load -min 3.33653  [get_nets DFF_2/clk]
set_resistance 8.32799e-05  [get_nets DFF_2/clk]
set_load -max 1.19479  [get_nets DFF_2/d]
set_load -min 1.08891  [get_nets DFF_2/d]
set_resistance 2.40761e-05  [get_nets DFF_2/d]
set_load -max 2.8676  [get_nets DFF_2/q]
set_load -min 2.58475  [get_nets DFF_2/q]
set_resistance 5.07498e-05  [get_nets DFF_2/q]
set_load -max 3.60812  [get_nets DFF_1/clk]
set_load -min 3.33653  [get_nets DFF_1/clk]
set_resistance 8.32799e-05  [get_nets DFF_1/clk]
set_load -max 0.947734  [get_nets DFF_1/d]
set_load -min 0.84992  [get_nets DFF_1/d]
set_resistance 1.53183e-05  [get_nets DFF_1/d]
set_load -max 2.45649  [get_nets DFF_1/q]
set_load -min 2.21908  [get_nets DFF_1/q]
set_resistance 5.06563e-05  [get_nets DFF_1/q]
set_load -max 3.60812  [get_nets DFF_0/clk]
set_load -min 3.33653  [get_nets DFF_0/clk]
set_resistance 8.32799e-05  [get_nets DFF_0/clk]
set_load -max 0.486085  [get_nets DFF_0/d]
set_load -min 0.426054  [get_nets DFF_0/d]
set_resistance 6.22522e-06  [get_nets DFF_0/d]
set_load -max 1.33097  [get_nets DFF_0/q]
set_load -min 1.20621  [get_nets DFF_0/q]
set_resistance 2.71276e-05  [get_nets DFF_0/q]
